# -*- coding: utf-8 -*-
"""Probability_Theory_HW_1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1TMOFy5Gn9bkzcqLZvwW-ADid4CdnfujK

**Задание 1.** 
Из колоды в 52 карты извлекаются случайным образом 4 карты. a) Найти вероятность того, что все карты – крести. б) Найти вероятность, что среди 4-х карт окажется хотя бы один туз.
"""

from math import factorial

def combinations(n, k):
    return int(factorial(n) / (factorial(k) * factorial(n - k)))

"""### **а)**

*I способ.*

Вероятность, что все 4 карты - крести.

Требуется сделать выборку 4 карт из 52. Нам не важен порядок, рассматриваем сочетания. Это даст нам общее количество вариантов выбора 4 карт из 52, в которых будут варианты, где все карты будут крести.

$$C_{52}^4 = \frac{52!}{4!\cdot48!} = 270575$$

Требуется найти такие варианты, где все карты крести. Для этого нужно выбрать 4 карты из одной масти, т.е. из 4 из 13. Количество способов выбрать 4 карты из крестей. Опять сочетания.

$$C_{13}^4 = \frac{13!}{4!\cdot 9!} = 715$$

Это даёт нам количество благоприятных исходов.

Окончательная вероятность будет отношением числа 

$$ P =\frac{C_{13}^4}{C_{52}^4} = \frac{715}{270575} =  0.0026$$
"""

# Программная реализация первого способа.
n = combinations(52, 4)
print( 'Общее количество исходов = ', n)

m = combinations(13, 4)
print('Количество благоприятсвующих исходов =', m)

print('Вероятность выбрать 4 карты, состоящих только из крестей = ', round(m/n, 6))

"""*II способ.*

Условная вероятность.

1) Количество благоприятствующих исходов на количество всех исходов при первом выборе = $\frac{13}{52}$

Требуется, чтобы и вторая карта была той же масти. Следовательно вероятность будет $\frac{12}{51}$

Аналогично для 3 карты $\frac{11}{50}$

Аналогично для 4 карты $\frac{10}{49}$

$$P = \frac{13}{52} \cdot \frac{12}{51}\cdot \frac{11}{50} \cdot \frac{10}{49} = 0.0026$$
"""

# Программная реализация второго способа.
P = (13 / 52) * (12 / 51) * (11 / 50) * (10 / 49)
print('Вероятность P = ', round(P, 6))

"""### **б)**

Найти вероятность, что среди 4-х карт окажется хотя бы один туз.

*I способ.*

Рассмотрим сочетания достать 4 карты из 52. И вычтем из всех сочетаний сочетания без тузов.

Все сочетания достать 4 карты из колоды.

$$C_{52}^4 = \frac{52!}{4!\cdot48!} = 270575$$

Колода без тузов будет состоять из 48 карт. Теперь найдём все сочетания 4 карт в этом подмножестве.

$$C_{48}^4 = \frac{48!}{4!\cdot44!} = 194508$$

Вычтем. Останутся только сочетания, где хотя бы 1 туз.

$$C_{1t} = C_{52}^4 - C_{48}^4 = 270575 - 194508 = 76145\$$

Находим вероятность. Это отношение сочетаний, где есть хотя бы 1 туз к общему числу сочетаний.

$$ P_{1t} =\frac{C_{1t}}{C_{52}^4} = \frac{76145}{270575} =  0.28$$
"""

# программная реализация I способа

С_4_52 = combinations(52, 4)
С_4_48 = combinations(48, 4)
C_1t= С_4_52 - С_4_48
P_1t = C_1t / С_4_52
print('Вероятность найти хотя бы одного туза среди 4 любых карт из колоды 52 = ', round(P_1t, 3))

"""*II способ*

Рассмотрим сочетание выбрать 1 туз из 4. 

$$C_{4}^1 = \frac{4!}{1!\cdot 3!} = 4 $$

Оставшиеся 3 карты могут быть любыми. Тогда
$$C_{48}^3 = \frac{48!}{3!\cdot 45!} =  17296$$

Нам нужно выполнение этих комбинаций одновременно. Т.е.

$$C_1 = C_{4}^1 * C_{48}^3$$

Рассмотрим сочетание выбрать 2 туза из 4. 

$$C_{4}^2 = \frac{4!}{2!\cdot 2!} = 6 $$

Оставшиеся 2 карты могут быть любыми. Тогда
$$C_{48}^2 = \frac{48!}{2!\cdot 46!} =  1128$$

$$C_2 = C_{4}^2 * C_{48}^2$$

Аналогично 3 туза из 4.

$$C_{4}^3 = \frac{4!}{3!\cdot 1!} = 4 $$

Оставшаяся 1 карта может быть любой. Тогда
$$C_{48}^1 = \frac{48!}{1!\cdot 47!} =  48$$

$$C_3 = C_{4}^3 * C_{48}^1$$

$$C_{4}^4 = 1 $$

$$C_{48}^0 = 1$$

$$C_4= C_{4}^4 * C_{48}^0$$


Нам требуется хотя бы один туз. Поэтому складываем полученные комбинации. Т.е. или такой случай или такой.

$C = C1 + C2 + C3 + C4$

Вероятность будет равна $P = \frac{C}{C_{52}^4} = 0.28$
"""

# программная реализация II способа

С_1_4 = combinations(4, 1)
C_2_4 = combinations(4, 2)
C_3_4 = combinations(4, 3)
C_4_4 = combinations(4, 4)

C_3_48 = combinations(48, 3)
C_2_48 = combinations(48, 2)
C_1_48 = combinations(48, 1)
C_0_48 = combinations(48, 0)


C1 = С_1_4 * C_3_48
C2 = C_2_4 * C_2_48
C3 = C_3_4 * C_1_48
C4 = C_4_4 * C_0_48
C = C1 + C2 + C3 +C4

С_4_52 = combinations(52, 4)
P = C / С_4_52
print('Вероятность найти хотя бы одного туза среди 4 любых карт из колоды 52 = ', round(P, 3))

"""**Задание 2.** 

На входной двери подъезда установлен кодовый замок, содержащий десять кнопок с цифрами от 0 до 9. Код содержит три цифры, которые нужно нажать одновременно. Какова вероятность того, что человек, не знающий код, откроет дверь с первой попытки?


*I способ.*


Найдём количество возможных комбинаций трёх кнопок из 10 цифр.

$$C_{10}^{3} = \frac{10!}{3!\cdot 7!} = 120$$

У нас число попыток равно 1. Тогда вероятность того, что человек, не знающий код, откроет дверь с первой попытки.

$$P = \frac{1}{120}$$


"""

# программная реализация первого способа

C = combinations(10, 3)
print('Вероятность с первой попытки подобрать код = ', round(1/C, 4))

"""*II способ.*

Рассмотрим условную вероятность.
Тогда вероятность найти верным первую цифру $\frac{3}{10}$.
Вероятность найти верным вторую цифру $\frac{2}{9}$.
Вероятность найти верным третью цифру $\frac{1}{8}$.

Нам нужно одновременно и одна и вторая и третья цифра. Поэтому *.

$$P = \frac{3}{10} \cdot \frac{2}{9} \cdot \frac{1}{8} = 0.008$$
"""

# программная реализация второго способа
P = (3 / 10) * (2 / 9) * (1 / 8)
print(round(P, 4))

"""**Задание 3.**

В ящике имеется 15 деталей, из которых 9 окрашены. Рабочий случайным образом извлекает 3 детали. Какова вероятность того, что все извлеченные детали окрашены?

*I способ.*

Число комбинаций, благоприятствующих событию.

$$C_{9}^{3} = \frac{9!}{3!\cdot 6!} = 84$$

Общее число комбинаций.

$$C_{15}^{3} = \frac{15!}{3!\cdot 12!} = 455$$

$$P = \frac{C_{9}^{3}}{C_{15}^{3}} = 0.1846$$
"""

# программная реализация первого способа

C_3_9 = combinations(9, 3)
C_3_15 = combinations(15, 3)
print('Вероятность что три детали окрашены ', round((C_3_9 / C_3_15), 4))

"""*II способ.*

$$P = \frac{9}{15}\cdot\frac{8}{14}\cdot\frac{7}{13} = 0.18$$
"""

# программная реализация второго способа

P = (9 / 15) * (8 / 14) * (7 / 13)
print(round(P, 4))

"""**Задание 4**

В лотерее 100 билетов. Из них 2 выигрышных. Какова вероятность того, что 2 приобретенных билета окажутся выигрышными?

*I способ.*

Число комбинаций, благоприятствующих событию.

$$C_{2}^{2} = 1$$

Общее число комбинаций.

$$C_{100}^{2} = \frac{100!}{2!\cdot 98!} = 4950$$

$$P = \frac{C_{2}^{2}}{C_{100}^{2}} = 0.0002$$
"""

# программная реализация первого способа

C_2_2 = combinations(2, 2)
C_2_100 = combinations(100, 2)
print('Вероятность что 2 билета выигрышные ', round((C_2_2 / C_2_100), 4))

"""*II способ.*

$$P = \frac{2}{100}\cdot\frac{1}{99} = 0.0002$$
"""

# программная реализация второго способа

P = (2 / 100) * (1 / 99)
print(round(P, 4))